[
    {
        "id": "weather-app",
        "name": "Weather App",
        "imgsrc": "weather.png",
        "link": "WeatherApp",
        "description": "WeatherApp is a responsive web application built with HTML, CSS, and JavaScript that utilizes a weather API to display real-time weather data for any location. It provides users with current temperature, humidity, and weather conditions in a clean, user-friendly interface, offering a seamless experience for checking weather updates."
    },
    {
        "id": "currency-app",
        "name": "Currency App",
        "imgsrc": "newcurrency.png",
        "link": "CurrencyApp",
        "description": "This web application, built using HTML, CSS, and JavaScript, allows users to convert between different currencies using real-time exchange rates from an external API. To optimize performance and reduce the number of API calls, the app stores the fetched exchange rates in localStorage. This cached data is used for future conversions, minimizing API usage. Additionally, the app supports offline functionality, where users can still convert currencies based on the last available rates saved in localStorage when they are offline."
    },
    {
        "id": "snake-app",
        "name": "Snake Game",
        "imgsrc": "snakegame.png",
        "link": "SnakeApp",
        "description": "I created a classic Snake Game using HTML, CSS, and JavaScript. In this game, the player controls a snake that grows longer by eating food, but must avoid colliding with the walls or its own tail. The design is responsive and lightweight, with smooth animations and simple, intuitive controls for a fun and challenging experience."
    },
    {
        "id": "tip-app",
        "name": "Tip App",
        "imgsrc": "tipap.png",
        "link": "TipApp",
        "description": "This simple and intuitive tip calculator app, built using HTML, CSS, and JavaScript, helps users quickly calculate the tip and total bill amount. Just input the bill amount, select the tip percentage, and the app instantly shows the total to pay and the per-person split if needed. It's a fast, user-friendly solution for hassle-free tipping."
    }
]